{
   "pageId":"t420",
   "title":"Creating the Ultimate T420",
   "tags":[
      "Hardware",
      "Coreboot"
   ],
   "masthead": {
     "image": "t420/masthead.png",
     "text-color": "#ffffff",
     "background-color": "#0000ff",
     "stroke-color": "#000000"
   },
   "page":[
      {
         "title":"What is this?",
         "body":[
            [
               {
                 "type":"container-vert",
                 "contents": [
                   {
                      "type":"text",
                      "text":"This is my laptop which I use daily. It was created using a T420, although only the motherboard and chassis are from a T420. I built this laptop because I'm interested in computer hardware, and thought that this would be a fun and educational project."
                   },
                   {
                      "type":"text",
                      "text":"Coreboot combined with full disk encryption and Linux makes this laptop one of the most secure ones available."
                   }
                 ]
               },
               {
                  "type":"img",
                  "src":"t420/IMG_20190914_184731.jpg"
               }
            ],
            [

            ]
         ]
      },
      {
         "title":"Modifications & Cost",
         "body":[
            [
               {
                  "type":"formatted-text",
                  "text":"<h5>Modifications</h5><table><tr><td><b>Bios</b></td><td> Coreboot CBET4000 4.11-1706-g34473ea6c9</td></tr><tr><td><b>Ram</b></td><td> 16gb DDR3L @ 1600MHz</td></tr><tr><td><b>CPU</b></td><td> i7-3740QM @ 2.8GHz</td></tr><tr><td><b>Wireless/Bluetooth&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</b></td><td> AX200</td></tr><tr><td><b>SSD</b></td><td> 1TB 860 Evo</td></tr><tr><td><b>Display</b></td><td> 14.0\" LP140QH1-SPB1 2560x1440 IPS Matte</td></tr><tr><td><b>Heatsink</b></td><td> 04W0408 dGPU + CPU fan</td></tr><tr><td><b>Battery</b></td><td> 9-Cell DTK</td></tr></table>"
               },
               {
                  "type":"formatted-text",
                  "text":"<h5>Cost Breakdown</h5><table><tr><td><b>Converter board</b></td><td> $67.72USD</td></tr><tr><td><b>Display</b></td><td> $62.00USD</td></tr><tr><td><b>CPU</b></td><td> $113.00USD</td></tr><tr><td><b>Keyboard</b></td><td> $23.90USD</td></tr><tr><td><b>Wifi Card</b></td><td> $24.88USD</td></tr><tr><td><b>GPU+CPU Heatsink</b></td><td> $25.50USD</td></tr><tr><td><b>1TB 860 Evo</b></td><td> $180.00CAD</td></tr><tr><td><b>Thermal Compound&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</b></td><td> $19.00CAD</td></tr><tr><td><b>9-Cell Battery</b></td><td> $52.80CAD</td></tr><tr><td><b>16GB Ram</b></td><td> $120.00CAD</td></tr><tr><td><b>GTX 770</b></td><td> $110.00CAD</td></tr><tr><td><b>Power Supply</b></td><td> $70.00CAD</td></tr><tr><td><b>V8.0 EXP GDC</b></td><td> $34.50CAD</td></tr><tr><td><b>Total</b></td><td> $765.46USD</td></tr></table>"
               }
            ]
         ]
      },
      {
        "title":"Chapter 1: Assembling the Laptop",
        "body":[
          [
            {
              "type":"container-vert",
              "width":"3",
              "contents": [{
                  "type":"text",
                  "text":"When I learned about Coreboot, I decided that it would be awesome to have it running on my laptop. The only problem was that at the time I was using an XPS 13 9350, which doesn’t support Coreboot. After extensive research I decided on using the T420 as the base of my build. Reasons for choosing it included the fact that it had one SPI flash chip as opposed to the 2 on the T430 making it easier to flash, USB 2.0 was good enough for me - most of my file transfer is through wifi or ethernet, and it has 420 in the name (this is a marijuana reference)."
                },
                {
                  "type":"text",
                  "text":"I set out to acquire all the necessary parts. I started by getting a T420 from some guy on Kijiji for $100. The laptop came with no battery, hard drive, and the keyboard was broken. This didn’t matter much, all of it was going to be replaced anyways. I started by cleaning up the laptop with isopropyl alcohol and Q-tips. This took a few hours because of how dirty the laptop was. After cleaning it, I put it back together and pressed the on button to check if it still worked. It didn’t turn on. The dead motherboard was put to the side, and I ordered a new one from aliexpress."
                },
                {
                  "type":"text",
                  "text":"Some other things I bought were the converter board needed to convert the LVDS motherboard output to eDP, an AUO b140HAN01.3 display, the AC 7260 wireless/bluetooth card and a new keyboard."
                }
              ]
            },
            {
              "type":"b-carousel",
              "width":"2",
              "interval":"10000000",
              "contents" : [
                {
                  "type":"img",
                  "src":"/t420/IMG_20181220_195808.jpg"
                },
                {
                  "type":"img",
                  "src":"/t420/IMG_20181211_183952_HDR.jpg"
                },
                {
                  "type":"img",
                  "src":"/t420/IMG_20181130_090417.jpg"
                },
                {
                  "type":"img",
                  "src":"/t420/IMG_20181201_135416.jpg"
                }
              ]
            }
          ],
          [
            {
              "type":"text",
              "text":"It took a few months for everything to come in, but when it did it was very exciting. I started by checking if the new motherboard worked – it did. I figured out the pinout of the SPI chip and read it using my raspberry pi, obtaining a copy of the old bios. I then extracted parts of it which were needed for the new Coreboot bios. These parts included the VGA rom, and the Intel ME section. I cloned Coreboot to my laptop, configured it the way it was shown in the wiki, and compiled it. This step was surprisingly straightforward and only took a few hours to do. During this step, the Intel ME was stripped and added to the new bios, along with the VGA rom. I moved the new bios to my raspberry pi and wrote it to the T420’s bios chip. After connecting the components, it was time for the moment of truth... Powering it on. I pressed the on button, and there was smoke, then nothing. The motherboard didn’t do anything after that... I must have shorted something by accident. I put this newly killed motherboard with the other, also dead motherboard. Disappointed that it didn’t work, I went on ebay and bought 2 more motherboards, knowing that I’d probably end up killing a few more."
            }
          ],
          [
            {
              "type":"container-vert",
              "width":"2",
              "contents":[
              {
                "type":"b-carousel",
                "interval":"10000000",
                "contents" : [
                  {
                    "type":"img",
                    "src":"/t420/IMG_20181211_183747_HDR.jpg"
                  },
                  {
                    "type":"img",
                    "src":"/t420/IMG_20181211_183832_HDR.jpg"
                  },
                  {
                    "type":"img",
                    "src":"/t420/IMG_20181220_215245.jpg"
                  }
                ]
              },
              {
                "style":"padding-top:20px",
                "type":"img",
                "src":"/t420/IMG_20190102_031431_HHT.jpg"
              }
              ]
            },
            {
              "type":"container-vert",
              "width":"3",
              "contents": [
                {
                  "type":"text",
                  "text":"After a few weeks of waiting, the new motherboards finally arrived. I tested the first one, and it worked! I set out again, more carefully, to flash the bios chip. After about an hour of checking pins and connecting stuff together, I managed to write to the SPI chip. Excited to see if it works, I connected the necessary components and powered it on. Seabios appeared at the top of the screen. It worked!"
                },
                {
                  "type":"text",
                  "text":"I disconnected everything, and added the new parts one by one. It booted with the wifi card. It booted with the new display. I finally got to upgrading the CPU to the quad core ivy bridge CPU and powering it on. It didn’t work. After taking the bios battery out and replacing, then power cycling it a few times it got to the Seabios screen but it didn’t look quite right. The fonts were too big, and everything on the display looked wavy. Ignoring this, I booted Linux and everything looked fine. Success!"
                },
                {
                  "type":"img",
                  "src":"t420/IMG_20181220_212426.jpg"
                },
                {
                  "type":"text",
                  "text":"I reassembled the laptop, this time including the SSD. After about an hour I had Linux Mint Xfce installed on the SSD with full disk software encryption, and everything was running smoothly."
                },
                {
                  "type":"text",
                  "text":"I started researching why the bios screen looked weird, and found out why. The VGA rom that I extracted from the original bios was for the Sandy Bridge CPU the motherboard originally had. Turns out, this VGA bios didn’t work with newer Ivy Bridge CPUs. I found a T430 bios dump and borrowed the VGA rom from it. After replacing the bios and rebooting, the bios screen looked right."
                },
                {
                  "type":"text",
                  "text":"Still not being able to leave the laptop alone, I decided that it would be fun trying a bios that wasn’t Seabios. I switched to TianoCore after reading some good things about it, and tried it out. The laptop was rebooted and went directly to the grub rescue command line. :(. After reading more about TianoCore, I realized that I hadn’t configured it to work with disk encryption, and so it couldn’t detect the hard drive. I also hadn’t configured it to be able to boot from USB sticks..."
                },
                {
                  "type":"text",
                  "text":"I got my screwdriver and raspberry pi, took the laptop apart and reflashed it."
                }
              ]
            }
          ]
        ]
      },
      {
         "title":"Chapter 2: The Problems",
         "body":[
           [
             {
              "type":"container-vert",
              "width":"3",
              "contents": [
                 {
                   "type":"text",
                   "text":"I happily used my laptop for a few months without too many issues. Temperatures were getting hot though, and I had to disable one of the cores completely to stop it from overheating."
                 },
                 {
                   "type":"text",
                   "text":"Another problem that I’ve encountered is the laptop randomly shutting down. This isn’t a huge problem as rebooting takes seconds and almost everything I do is constantly being automatically saved, although this rebooting can be annoying in games."
                 },
                 {
                   "type":"text",
                   "text":"I’ve tried replacing the ram and network card, but the problem persists. I think the problem has something to do with the motherboard, eventually I plan on replacing it again."
                 }
              ]
             },
             {
               "width":"2",
               "type":"img",
               "src":"t420/IMG_20181220_195808.jpg"
             }
           ]
         ]
      },
      {
        "title":"Chapter 3: Fixing the Problems",
        "body":[
           [
             {
               "width":"2",
               "type":"img",
               "src":"t420/IMG_20190111_133701.jpg"
             },
             {
              "type":"container-vert",
              "width":"3",
              "contents": [
                 {
                   "type":"text",
                   "text":"To fix the overheating problem, I ordered the dGPU heatsink. After installing it, temperatures went from 70 when idle to high 40’s. This, along with a custom fan curve using Thinkfan almost always prevents the laptop from overheating."
                 },
                 {
                   "type":"text",
                   "text":"As for the random rebooting problem – I haven’t solved that yet. I’ve tried updating the kernel and bios multiple times, with no results. It only occurs every few days so it’s not really a huge problem at the moment. I’m sure in the future it’ll become annoying enough to try to fix it."
                 }
              ]
             }
           ]
        ]
      },
      {
        "title":"Chapter 4: Oled Shenanigans",
        "body":[
           [
             {
               "width":"2",
               "type":"vid",
               "src":"t420/VID_20190221_162057.mp4"
             },
             {
              "type":"container-vert",
              "width":"3",
              "contents": [
                 {
                   "type":"text",
                   "text":"The palm rest was pretty dirty. I decided it was time to buy a new one and replace it, but before that I wanted to have some fun."
                 },
                 {
                   "type":"text",
                   "text":"At the bottom of the laptop there’s an empty mpcie slot which has USB, and there’s a ton of space in the chasis if I remove the disk drive. I decided I wanted to add a small Oled display to the palm rest, to show data about the laptop."
                 },
                 {
                   "type":"text",
                   "text":"I started by writing the software, programming an esp32 I had lying around, and testing it. It worked! I wired everything up, using the bottom mpcie’s USB lanes, and running the esp32 on the laptop’s power. The esp32 sat nicely inside of the disk drive bay. After booting up the laptop everything worked great. I ran in to a small problem, though. The data wires were too thick for me to put the keyboard on. After taking a video, I removed everything and installed the new palm rest. Maybe I’ll revisit this idea later, it looked pretty neat."
                 }
              ]
             }
           ]
        ]
      },
      {
        "title":"Chapter 5: The eGPU Saga",
        "body":[
           [
             {
               "width":"2",
               "type":"vid",
               "src":"t420/VID_20190222_010136.mp4"
             },
             {
              "type":"container-vert",
              "width":"3",
              "contents": [
                 {
                   "type":"text",
                   "text":"I was on /r/thinkpad and saw someone using a GTX 550 with their Thinkpad. I did some research in to this, and realized that the weird port on the side of my laptop was an expresscard port, and was actually useful for cool stuff. Multiple people on reddit and other forums said different things about how well it would work. A few people said it wouldn’t work with Coreboot at all and others said everything worked fine. Ultimately, I decided everything was cheap enough to just go ahead and try it myself. I bought a V8.0 EXP GDC from aliexpress, and a power supply from Newegg. Both came relatively quickly. I got a GTX 770 from someone on Kijiji. After installing the Nvidia drivers, I plugged everything in and booted the laptop. I checked to see if the laptop found the GPU, and it did! After running some benchmarks I concluded that everything was working properly."
                 },
                 {
                   "type":"text",
                   "text":"The first game I tried was Civ5, which seemingly worked well. Knowing this was a game mostly bound by CPU performance, I checked performance in CSGO. As soon as the game loaded I knew something was wrong – the latency was horrible. This was due to the low bandwidth. I plugged my GPU in to an old display I had, and everything worked smoothly. Makes sense, the bandwidth was basically doubled by not having to send data two ways."
                 }
              ]
             }
           ]
        ]
      },
      {
        "title":"Chapter 6: Finishing Touches",
        "body":[
           [
             {
              "type":"container-vert",
              "width":"3",
              "contents": [
                 {
                   "type":"text",
                   "text":"While working at a co-op, I realized how much more efficient it is to have multiple monitors. I decided to buy a 2k monitor to use with the laptop. It worked nicely, and allowed me to play games easily by just connecting my eGPU and rebooting."
                 },
                 {
                   "type":"text",
                   "text":"About a month later, I was going through some old hardware my co-op company had and found a T420 dock. Excited with this find, I asked if I could have it and they told me that it was mine for $25. I bought it and set it up with the monitor. Everything worked perfectly. It’s convenient being able to dock the laptop when I’m at my desk by just putting it down, and being able to pick it up whenever without worrying about disconnecting cables."
                 }
              ]
             },
             {
               "width":"2",
               "type":"img",
               "src":"t420/IMG_20190405_191847.jpg"
             }
           ],
           [
             {
               "type":"formatted-text",
               "text":"<h5>Would I suggest building a similar laptop?</h5>"
             }
           ],
           [
             {
               "type":"text",
               "text":"It really depends on what you enjoy doing. I personally enjoy solving problems and tinkering, which makes this laptop great. The weight and 3 to 4 hour battery life is a decent trade off for the added security and performance this laptop provides. I’ve had hours of fun with this laptop debugging problems and taking it apart countless times to upgrade it. I find that the display looks really nice and the keyboard is the best I have ever used. Knowing that if anything goes wrong I can fix it is nice coming from the XPS 13 where if one component fails it’s going to cost $500+ for the replacement parts. This laptop also provides many cheap upgrade paths to increase the storage capacity, such as using one of the mSata slots for storage, and replacing the disk drive with another SSD."
             }
           ],
           [
             {
               "type":"text",
               "text":"Overall, I really like this laptop and will use it for the foreseeable future, but a laptop like this wouldn’t work for most people."
             }
           ]
        ]
      },
      {
        "title":"Update - February 27th 2020",
        "body":[
           [
             {
               "type":"text",
               "text":"I just got another working T420 for $65 on kijiji. Planning on flashing coreboot to it and swapping parts soon. Hoping this fixes the rebooting problem!"
             }
           ]
        ]
      },
      {
        "title":"Update - March 8th 2020",
        "body":[
           [
             {
               "type":"text",
               "text":"Bought a 1440p display and converter board ($250cad), and a AX200HMW wifi card ($32cad). I'll put everything together and take some pictures in a month or so when the parts come in."
             }
           ]
        ]
      },
      {
        "title":"Update - March 15th 2020",
        "body":[
           [
             {
               "type":"text",
               "text":"I sold the display from the new Kijiji laptop for $40, which means the net cost of the motherboard was $15 which is very reasonable."
             }
           ]
        ]
      },
      {
        "title":"Chapter 7: Upgrades",
        "body":[
           [
             {
              "type":"container-vert",
              "width":"3",
              "contents": [
                 {
                   "type":"text",
                   "text":"After a few weeks of waiting, the display and display adaptor arrived. I was super excited to get to work reprogramming the bios on the new motherboard and assembling the computer."
                 },
                 {
                   "type":"text",
                   "text":"I started by testing the new display with my current laptop. I was worried it wouldn't work, as a while ago I read that dual LVDS didn't have enough bandwidth to drive a 1440p display at 60Hz. I had decided to go ahead and get the display anyways because someone else said they got this setup working, and I saw a post from a few years ago explaining how 1440p was possible with dual LVDS by reducing the amount of display blanking cycles to 1 or 2."
                 }
              ]
             },
             {
               "width":"2",
               "type":"img",
               "src":"t420/1440p/001.jpg"
             }
           ],
           [
             {
              "type":"container-vert",
              "width":"3",
              "contents": [
                 {
                   "type":"text",
                   "text":"Surprisingly, when the display was attached and the laptop was booted everything worked and looked great. Time to start disassembling the new laptop. The motherboard was removed from its chassis and cleaned up (I have enough dead motherboards...)"
                 },
                 {
                   "type":"text",
                   "text":"I attached the new display to the new motherboard, and did some testing to make sure both of them were working properly and had no defects. Once satisfied, I got out the bios programmer that I bought a couple months ago and reprogrammed the bios. I booted up the laptop and ... nothing. Black screen. Time to start debugging. I soon realized that nothing was being displayed because this new motherboard had the sandy bridge CPU in it, and the bios I had was configured for ivy bridge graphics. It was probably time to upgrade the bios image anyways, so I cloned the latest version of the coreboot project, configured everything and compiled it with the sandy bridge graphics. I reprogrammed the bios again and powered it on. Success! The display said \"Seabios\" at the top. Happy with the results, I started swapping over the components, starting with the CPU. Instead of just taking out the CPU and putting it in the new motherboard, I swapped the CPU with the one in the laptop I was using at the time knowing that debugging any problems would be a lot easier if I had at least one working laptop (I lent my xps 13 to a friend). After doing this the bios was reprogrammed to use ivy bridge graphics, and the laptop was tested again. \"Seabios\" appeared at the top of the display."
                 }
              ]
             },
             {
               "type":"container-vert",
               "width":"2",
               "contents": [ {
                 "type":"img",
                 "src":"t420/1440p/004.jpg"
               },
               {
                 "style":"padding-top:20px",
                 "type":"img",
                 "src":"t420/1440p/005.jpg"
               }
                ]
             }
           ],
           [
             {
              "type":"container-vert",
              "width":"3",
              "contents": [
                 {
                   "type":"text",
                   "text":"Everything was working as expected, so I turned off my main laptop to move the parts over. I dismantled the display and installed the new panel, moved over the ram, network card, and hard drive. The laptop was fully assembled and working in a few hours."
                 }
              ]
             },
             {
               "width":"2",
               "type":"img",
               "src":"t420/1440p/006.jpg"
             }
           ],
           [
             {
              "type":"container-vert",
              "width":"3",
              "contents": [
                 {
                   "type":"text",
                   "text":"I did some stress testing to make sure the heatsink was seated correctly on the CPU, and the fan was working. Thermals looked good, but there was a not so great sound coming from the fan. Sounded like the fan wasn't properly balanced, and it was causing everything to vibrate."
                 }
              ]
             },
             {
               "width":"2",
               "type":"img",
               "src":"t420/1440p/009.jpg"
             }
           ],
           [
             {
              "type":"container-vert",
              "width":"3",
              "contents": [
                 {
                   "type":"text",
                   "text":"After taking it off and putting it back on a few times I decided that the best way to solve this would be to take the fan from the new Kijiji laptop and attach it to my heatsink. A few hours and lots of thermal paste later I had a quiet, working fan+heatsink with good thermals. On a light workload the CPU will stay around 45 degrees with the fan being almost inaudible (3500 rpm), and when stress testing the CPU will go from around 90 degrees during all core boost of 3.7ghz to 70 degrees when it throttles down to 2.8ghz"
                 },
                 {
                   "type":"text",
                   "text":"I noticed a problem with the laptop after using it for a few hours - I missed the screw that locked the barrel connector for power in place. The made charging the laptop hard, as the plug wouldn't connect properly. Protip, don't forget this screw if you're putting together a T420. I had to disassembly the laptop again so this screw could be put in place. Since it's under the bottom casing, I had to take off both the top casing and the bottom one."
                 }
              ]
             },
             {
               "width":"2",
               "type":"img",
               "src":"t420/1440p/008.jpg"
             }
           ],
           [
             {
              "type":"container-vert",
              "width":"3",
              "contents": [
                 {
                   "type":"text",
                   "text":"Four days after this, the AX200 network card came in. It took maybe a minute to replace it, and it works great. Bluetooth and Wifi both have better ranges now, and the wifi connection is much faster and more stable."
                 },
                 {
                   "type":"text",
                   "text":"As for the rebooting problem - I've been using the laptop for 5 days now and it hasn't rebooted once. The motherboard I had before was almost definitely the problem. I'm extremely happy with this laptop. Having used it for a week without random rebooting and thermal problems, a quieter fan, a 1440p display and better wifi/bluetooth has reminded me why I like this laptop so much. Being able to fix any problems and upgrade everything is amazing."
                 }
              ]
             },
             {
               "width":"2",
               "type":"img",
               "src":"t420/1440p/000.jpg"
             }
           ]
        ]
      },
      {
        "title":"Gallery Upgraded",
        "body":[
          [
            {
              "type":"b-carousel",
              "contents":[
                {"src":"t420/1440p/000.png"},
                {"src":"t420/1440p/001.png"},
                {"src":"t420/1440p/002.png"},
                {"src":"t420/1440p/003.png"},
                {"src":"t420/1440p/004.png"},
                {"src":"t420/1440p/005.png"},
                {"src":"t420/1440p/002.jpg"},
                {"src":"t420/1440p/003.jpg"},
                {"src":"t420/1440p/007.jpg"}
              ]
            }
          ],
          [
            {
              "type":"divider"
            }
          ]
        ]
      },
      {
        "title":"Gallery",
        "body":[
          [
            {
              "type":"b-carousel",
              "contents":[
                {
                    "src":"t420/IMG_20191024_184943.jpg",
                    "caption":"Rip..."
                },
                {"src":"t420/IMG_20181218_211101.jpg"},
                {"src":"t420/IMG_20181218_211114.jpg"},
                {"src":"t420/IMG_20181218_212558.jpg"},
                {"src":"t420/IMG_20181220_191631.jpg"},
                {"src":"t420/IMG_20190104_140848.jpg"},
                {"src":"t420/IMG_20190104_141006.jpg"},
                {"src":"t420/IMG_20190103_140054_HHT.jpg"},
                {"src":"t420/IMG_20190103_140219.jpg"},
                {"src":"t420/IMG_20190104_101528.jpg"},
                {"src":"t420/IMG_20190914_111836.jpg"},
                {"src":"t420/IMG_20190914_184700.jpg"}
              ]
            }
          ],
          [
            {
              "type":"divider"
            }
          ]
        ]
      }
   ]
}
